EbadSyed/v2.1/app/mcu_example/SLSTK3701A_EFM32GG11/micriumos_webmic/net/core/net_core.c
/***************************************************************************//**
 * @file net_core.c
 * @brief Network core initialization using ethernet interface
 * @version 5.3.5
 *******************************************************************************
 * # License
 * <b>Copyright 2017 Silicon Labs, Inc. http://www.silabs.com</b>
 *******************************************************************************
 *
 * This file is licensed under the Silabs License Agreement. See the file
 * "Silabs_License_Agreement.txt" for details. Before using this software for
 * any purpose, you must agree to the terms of that agreement.
 *
 ******************************************************************************/

#include  <rtos_description.h>

#include  "../../description.h"

#include <stdbool.h>

#include  <net_cfg.h>

#include  <rtos/cpu/include/cpu.h>
#include  <rtos/common/include/lib_str.h>
#include  <rtos/common/include/lib_mem.h>
#include  <rtos/common/include/rtos_err.h>
#include  <rtos/common/include/rtos_utils.h>

#include  <rtos/net/include/net.h>
#include  <rtos/net/include/net_type.h>
#include  <rtos/net/include/net_if.h>
#include  <rtos/net/include/net_ascii.h>
#include  <rtos/net/include/dhcp_client.h>
#include  <rtos/net/include/dhcp_client_types.h>
#include  <rtos/net/include/net_ipv4.h>
#include  <rtos/net/include/net_ipv6.h>
#include  <rtos/net/include/net_if_ether.h>

#ifdef  RTOS_MODULE_NET_IF_LOOPBACK_AVAIL
#include  <rtos/net/include/net_if_loopback.h>
#endif

#include "em_device.h"

/***************************************************************************//**
 * @brief logging: This example outputs information to the console via 
 *                 the function printf() via a macro called EX_TRACE().
 *                 This can be modified or disabled if printf() is not supported
 ******************************************************************************/
#ifndef EX_TRACE
#include  <stdio.h>
#define  EX_TRACE(...)                                      printf(__VA_ARGS__)
#endif

// -----------------------------------------------------------------------------
// DEFINES

#if (defined(RTOS_MODULE_NET_IF_ETHER_AVAIL) \
  || defined(RTOS_MODULE_NET_IF_WIFI_AVAIL))
#define  EX_NET_CORE_IF_EXT_EN
#endif

// -----------------------------------------------------------------------------
// Global Variables

#if (RTOS_CFG_EXTERNALIZE_OPTIONAL_CFG == DEF_ENABLED)
extern  const   NET_INIT_CFG  Net_InitCfgDflt;
#endif

NET_IF_NBR ifnNbr;

// -----------------------------------------------------------------------------
// Local Function Prototypes

#ifdef  EX_NET_CORE_IF_EXT_EN
static  void  Ex_IPv6_AddrCfgResult          (NET_IF_NBR                  if_nbr,
                                              NET_IPv6_CFG_ADDR_TYPE      addr_type,
                                              const  NET_IPv6_ADDR              *p_addr_cfgd,
                                              NET_IPv6_ADDR_CFG_STATUS    addr_cfg_status);

static  void  Ex_DHCPc_SetupResult           (NET_IF_NBR                  if_nbr,
                                              DHCPc_STATUS                status,
                                              NET_IPv4_ADDR               addr,
                                              NET_IPv4_ADDR               mask,
                                              NET_IPv4_ADDR               gateway,
                                              RTOS_ERR                    err);

static  void  Ex_IPv4_LinkLocalAddrCfgResult (NET_IF_NBR                  if_nbr,
                                              NET_IPv4_ADDR               link_local_addr,
                                              NET_IPv4_LINK_LOCAL_STATUS  status,
                                              RTOS_ERR                    err);

#if ((NET_IPv4_CFG_EN == DEF_ENABLED) \
  && (NET_DHCP_CLIENT_CFG_MODULE_EN == DEF_ENABLED))
static  void  Ex_DHCPc_Hook                  (NET_IF_NBR                  if_nbr,
                                              DHCPc_STATUS                status,
                                              NET_IPv4_ADDR               addr,
                                              NET_IPv4_ADDR               mask,
                                              NET_IPv4_ADDR               gateway,
                                              RTOS_ERR                    err);
#endif
#endif

static void  Ex_MacAddrGet(CPU_CHAR * addr_mac_str);

// -----------------------------------------------------------------------------
// Local Global Variables

static  const  NET_IF_ETHER_CFG  Ex_NetIF_CfgDflt_Ether = {
  .HW_AddrStr                    = "00:00:00:00:00:00",

  .IPv4.Static.Addr              = DEF_NULL,
  .IPv4.Static.Mask              = DEF_NULL,
  .IPv4.Static.Gateway           = DEF_NULL,

  .IPv4.DHCPc.En                 = DEF_YES,
  .IPv4.DHCPc.Cfg                = DHCPc_CFG_DFLT,
  .IPv4.DHCPc.OnCompleteHook     = Ex_DHCPc_SetupResult,

  .IPv4.LinkLocal.En             = DEF_NO,
  .IPv4.LinkLocal.OnCompleteHook = Ex_IPv4_LinkLocalAddrCfgResult,

  .IPv6.Static.Addr              = DEF_NULL,
  .IPv6.Static.PrefixLen         = 0,
  .IPv6.Static.DAD_En            = DEF_NO,
  .IPv6.AutoCfg.En               = DEF_YES,
  .IPv6.AutoCfg.DAD_En           = DEF_NO,
  .IPv6.Hook                     = Ex_IPv6_AddrCfgResult
};

/***************************************************************************//**
 * @brief Initialize the Network TCP-IP core and add an Ethernet Interface.
 * @note Simplest initialization without any overwrite of default configuration
 ******************************************************************************/
void  Ex_Net_CoreInit(void)
{
  RTOS_ERR    err;

  // INITIALIZE NETWORK TASKS & OBJECTS
  Net_Init(&err);
  APP_RTOS_ASSERT_CRITICAL((err.Code == RTOS_ERR_NONE),; );

#ifdef  RTOS_MODULE_NET_IF_LOOPBACK_AVAIL
  // ADD LOOPBACK INTERFACE
  NetIF_Loopback_Init(DEF_NULL, &err);
  APP_RTOS_ASSERT_CRITICAL((err.Code == RTOS_ERR_NONE),; );
#endif

  // ADD ETHERNET INTERFACE
  NetIF_Ether_Add("eth0",
                  DEF_NULL,
                  DEF_NULL,
                  &err);
  APP_RTOS_ASSERT_CRITICAL((err.Code == RTOS_ERR_NONE),; );
}

/***************************************************************************//**
 * @brief Starts network interface(s).
 * @note (1) If the Ethernet module is available and the "eth0" was registered 
 *           and added, this function will start that network interface.
 *       (2) If the WiFi module is available and the "wifi0" was registered
 *           and added, this function will start that network interface.
 ******************************************************************************/
void  Ex_Net_CoreStartIF(void)
{
  NET_IF_NBR         if_nbr;
  RTOS_ERR           err;
  NET_IF_ETHER_CFG   if_cfg_ether;
  CPU_CHAR           addr_mac_str[NET_IF_802x_ADDR_SIZE_STR];
  
  // INTERFACE SETTINGS
  // Keep Default settings that enables DHCP client for...
  // IPv4 and SLAAC for IPv6.
  if_cfg_ether = Ex_NetIF_CfgDflt_Ether;
  Ex_MacAddrGet(addr_mac_str);
  if_cfg_ether.HW_AddrStr = addr_mac_str;

  // RECOVER INTERFACE NUMBER FROM INTEFACE NAME
  if_nbr = NetIF_NbrGetFromName("eth0");
  APP_RTOS_ASSERT_CRITICAL((if_nbr != NET_IF_NBR_NONE),; );

  // START ETHERNET INTERFACE
  NetIF_Ether_Start(if_nbr, &if_cfg_ether, &err);
  APP_RTOS_ASSERT_CRITICAL((err.Code == RTOS_ERR_NONE),; );

#if (NET_IF_CFG_WAIT_SETUP_READY_EN == DEF_ENABLED)
  NET_IF_APP_INFO if_app_info;
  // WAIT FOR INTEFACE SETUP TO FINISH
  printf("eth0: Waiting for interface to be ready\n");
  NetIF_WaitSetupReady(if_nbr, &if_app_info, 0, &err);
  printf("eth0: interface ready\n");
  APP_RTOS_ASSERT_CRITICAL((err.Code == RTOS_ERR_NONE),; );
#endif
}

/***************************************************************************//**
 * @brief Start an Ethernet Interface.
 * @note (1) In this example no NET_IF_ETHER_CFG structure is passed to 
 *           the start function.
 *           Therefore, no address setup is done by the start function
 *           and it must be done explicitly with DHCP client,
 *           IPv4 and IPv6 API calls, and after the call to NetIF_Ether_Start().
 ******************************************************************************/
#ifdef  RTOS_MODULE_NET_IF_ETHER_AVAIL
void  Ex_Net_CoreStartEther(void)
{
  NET_IF_NBR      if_nbr;
  RTOS_ERR        err;
#if (NET_IPv4_CFG_EN == DEF_ENABLED)
  NET_IPv4_ADDR   addr_ipv4;
  NET_IPv4_ADDR   msk_ipv4;
  NET_IPv4_ADDR   gateway_ipv4;
#endif
#if  (NET_IPv6_CFG_EN == DEF_ENABLED)
  CPU_BOOLEAN     cfg_result  = DEF_FAIL;
  NET_FLAGS       ipv6_flags;
  NET_IPv6_ADDR   addr_ipv6;
#endif

  // RECOVER INTERFACE NUMBER FROM INTEFACE NAME
  if_nbr = NetIF_NbrGetFromName("eth0");
  APP_RTOS_ASSERT_CRITICAL((if_nbr != NET_IF_NBR_NONE),; );

  // START ETHERNET INTERFACE
  NetIF_Ether_Start(if_nbr, DEF_NULL, &err);
  APP_RTOS_ASSERT_CRITICAL((err.Code == RTOS_ERR_NONE),; );

#if (NET_IPv4_CFG_EN == DEF_ENABLED)
  // ENABLE DHCP PROCESS ON NETWORK INTEFACE
#if (NET_DHCP_CLIENT_CFG_MODULE_EN == DEF_ENABLED)
  DHCPc_IF_Add(if_nbr, DEF_NULL, Ex_DHCPc_Hook, &err);
  APP_RTOS_ASSERT_CRITICAL((err.Code == RTOS_ERR_NONE),; );
#endif

  // CONFIGURE IPV4 STATIC ADDRESSES
  // TODO Update IPv4 Address, Mask and Gateway below...
  // following your network requirements.

  // Convert Host IPv4 string address to 32 bit address.
  NetASCII_Str_to_IP("10.10.10.64",
                     &addr_ipv4,
                     NET_IPv4_ADDR_SIZE,
                     &err);
  APP_RTOS_ASSERT_CRITICAL((err.Code == RTOS_ERR_NONE),; );

