EbadSyed/v2.1/app/mcu_example/SLSTK3701A_EFM32GG11/micriumos_webmic/net/core/net_core.c
  // Convert IPv4 mask string to 32 bit address.
  NetASCII_Str_to_IP("255.255.255.0",
                     &msk_ipv4,
                     NET_IPv4_ADDR_SIZE,
                     &err);
  APP_RTOS_ASSERT_CRITICAL((err.Code == RTOS_ERR_NONE),; );

  // Convert Gateway string address to 32 bit address.
  NetASCII_Str_to_IP("10.10.10.1",
                     &gateway_ipv4,
                     NET_IPv4_ADDR_SIZE,
                     &err);
  APP_RTOS_ASSERT_CRITICAL((err.Code == RTOS_ERR_NONE),; );

  // Add a statically-configured IPv4 host address,   ...
  // ... subnet mask, & default gateway to the        ...
  // ... interface.
  NetIPv4_CfgAddrAdd(if_nbr,
                     addr_ipv4,
                     msk_ipv4,
                     gateway_ipv4,
                     &err);
  APP_RTOS_ASSERT_CRITICAL((err.Code == RTOS_ERR_NONE),; );
#endif // NET_IPv4_CFG_EN

#if  (NET_IPv6_CFG_EN == DEF_ENABLED)

  // Set hook function to received addr cfg result.
  NetIPv6_AddrSubscribe(&Ex_IPv6_AddrCfgResult, &err);
  APP_RTOS_ASSERT_CRITICAL((err.Code == RTOS_ERR_NONE),; );

#if  (NET_IPv6_CFG_ADDR_AUTO_CFG_EN == DEF_ENABLED)
  // ENABLE IPV6 STATELESS AUTO-CONFIGURATION

  // Enable and Start Auto-Configuration process.
  cfg_result = NetIPv6_AddrAutoCfgEn(if_nbr,
                                     DEF_YES,
                                     &err);
  APP_RTOS_ASSERT_CRITICAL((err.Code == RTOS_ERR_NONE),; );
#endif
  // CONFIGURE IPV6 STATIC LINK LOCAL ADDRESS
  // DHCPv6c is not yet available.

  // TODO Update IPv6 Address below following your network requirements.

  // Convert IPv6 string address to 128 bit address.
  NetASCII_Str_to_IP("fe80::1111:1111",
                     &addr_ipv6,
                     NET_IPv6_ADDR_SIZE,
                     &err);
  APP_RTOS_ASSERT_CRITICAL((err.Code == RTOS_ERR_NONE),; );

  ipv6_flags = 0;
  // Enable DAD with Address Configuration.
  DEF_BIT_SET(ipv6_flags, NET_IPv6_FLAG_DAD_EN);

  // Add a statically-configured IPv6 host address to ...
  // ... the interface.
  NetIPv6_CfgAddrAdd(if_nbr,
                     &addr_ipv6,
                     64,
                     ipv6_flags,
                     &err);
  APP_RTOS_ASSERT_CRITICAL((err.Code == RTOS_ERR_NONE),; );

  PP_UNUSED_PARAM(cfg_result);
#endif // NET_IPv6_CFG_EN
}
#endif

/***************************************************************************//**
 *  @brief Hook function to received 
 *         any IPv6 address configuration process result.
 *
 *  @param if_nbr Network Interface number on 
 *                 which address configuration occurred.
 *
 *  @param addr_type IPv6 address type:
 *                                  NET_IPv6_CFG_ADDR_TYPE_STATIC
 *                                  NET_IPv6_CFG_ADDR_TYPE_AUTO_CFG_LINK_LOCAL
 *                                  NET_IPv6_CFG_ADDR_TYPE_AUTO_CFG_GLOBAL
 *
 *  @param p_addr_cfgd Pointer to IPv6 address configured, if any.
 *                     DEF_NULL, otherwise.
 *
 *  @param addr_cfg_status Result status of the IPv6 address 
 *                         configuration process:
 *                                  NET_IPv6_ADDR_CFG_STATUS_SUCCEED
 *                                  NET_IPv6_ADDR_CFG_STATUS_FAIL
 *                                  NET_IPv6_ADDR_CFG_STATUS_DUPLICATE
 ******************************************************************************/
#ifdef  EX_NET_CORE_IF_EXT_EN
static  void  Ex_IPv6_AddrCfgResult(NET_IF_NBR                 if_nbr,
                                    NET_IPv6_CFG_ADDR_TYPE     addr_type,
                                    const  NET_IPv6_ADDR             *p_addr_cfgd,
                                    NET_IPv6_ADDR_CFG_STATUS   addr_cfg_status)
{
  CPU_CHAR   ip_string[NET_ASCII_LEN_MAX_ADDR_IPv6];
  RTOS_ERR   err;

  PP_UNUSED_PARAM(if_nbr);

  if (p_addr_cfgd != DEF_NULL) {
    NetASCII_IPv6_to_Str((NET_IPv6_ADDR *)p_addr_cfgd, ip_string, DEF_NO, DEF_NO, &err);
    APP_RTOS_ASSERT_CRITICAL((err.Code == RTOS_ERR_NONE),; );
    EX_TRACE("IPv6 Address Link Local: %s\n", ip_string);
  }

  switch (addr_type) {
    case NET_IPv6_CFG_ADDR_TYPE_STATIC:
      switch (addr_cfg_status) {
        case NET_IPv6_ADDR_CFG_STATUS_SUCCEED:
          EX_TRACE("IPv6 Address Static: %s, configured successfully\n", ip_string);
          break;

        case NET_IPv6_ADDR_CFG_STATUS_DUPLICATE:
          EX_TRACE("IPv6 Address Static already exists on the network\n");
          break;

        default:
          EX_TRACE("IPv6 Address Static configuration failed.\n");
          break;
      }
      break;

    case NET_IPv6_CFG_ADDR_TYPE_AUTO_CFG_LINK_LOCAL:
      switch (addr_cfg_status) {
        case NET_IPv6_ADDR_CFG_STATUS_SUCCEED:
          EX_TRACE("IPv6 Address Link Local: %s, configured successfully\n", ip_string);
          break;

        case NET_IPv6_ADDR_CFG_STATUS_DUPLICATE:
          EX_TRACE("IPv6 Address Link Local already exists on the network\n");
          break;

        default:
          printf("IPv6 Address Link Local configuration failed.\n");
          break;
      }
      break;

    case NET_IPv6_CFG_ADDR_TYPE_AUTO_CFG_GLOBAL:
      switch (addr_cfg_status) {
        case NET_IPv6_ADDR_CFG_STATUS_SUCCEED:
          EX_TRACE("IPv6 Address Global: %s, configured successfully\n", ip_string);
          break;

        case NET_IPv6_ADDR_CFG_STATUS_DUPLICATE:
          EX_TRACE("IPv6 Address Global already exists on the network\n");
          break;

        default:
          EX_TRACE("IPv6 Address Global configuration failed.\n");
          break;
      }
      break;

    default:
      break;
  }
}
#endif

/***************************************************************************//**
 *  @brief Hook function called when DHCP process 
 *         has been complete on an network interface.
 *
 *  @param if_nbr Network Interface number on which DHCP process occurred.
 *
 *  @param status DHCP process status:
 *                               DHCPc_STATUS_SUCCESS
 *                               DHCPc_STATUS_FAIL_ADDR_USED
 *                               DHCPc_STATUS_FAIL_OFFER_DECLINE
 *                               DHCPc_STATUS_FAIL_NAK_RX
 *                               DHCPc_STATUS_FAIL_NO_SERVER
 *                               DHCPc_STATUS_FAIL_ERR_FAULT
 *
 *  @param addr IPv4 address configured, if any.
 *              Else, NET_IPv4_ADDR_NONE.
 *
 *  @param mask IPv4 mask configured, if any.
 *              Else, NET_IPv4_ADDR_NONE.
 *
 *  @param gateway IPv4 gateway configured, if any.
 *                 Else, NET_IPv4_ADDR_NONE.
 *
 *  @param err Error object in case an error occurred.
 *             Else, RTOS_ERR_NONE.
 ******************************************************************************/
#ifdef  EX_NET_CORE_IF_EXT_EN
static  void  Ex_DHCPc_SetupResult(NET_IF_NBR     if_nbr,
                                   DHCPc_STATUS   status,
                                   NET_IPv4_ADDR  addr,
                                   NET_IPv4_ADDR  mask,
                                   NET_IPv4_ADDR  gateway,
                                   RTOS_ERR       err)
{
  CPU_CHAR   addr_string[NET_ASCII_LEN_MAX_ADDR_IPv4];
  CPU_CHAR   mask_string[NET_ASCII_LEN_MAX_ADDR_IPv4];
  CPU_CHAR   gateway_string[NET_ASCII_LEN_MAX_ADDR_IPv4];
  RTOS_ERR   local_err;

  PP_UNUSED_PARAM(if_nbr);

  switch (status) {
    case DHCPc_STATUS_SUCCESS:
      NetASCII_IPv4_to_Str(addr, addr_string, DEF_NO, &local_err);
      APP_RTOS_ASSERT_CRITICAL((local_err.Code == RTOS_ERR_NONE),; );

      NetASCII_IPv4_to_Str(mask, mask_string, DEF_NO, &local_err);
      APP_RTOS_ASSERT_CRITICAL((local_err.Code == RTOS_ERR_NONE),; );

      NetASCII_IPv4_to_Str(gateway, gateway_string, DEF_NO, &local_err);
      APP_RTOS_ASSERT_CRITICAL((local_err.Code == RTOS_ERR_NONE),; );

