EbadSyed/v2.1/app/mcu_example/SLSTK3701A_EFM32GG11/micriumos_webmic/net/core/net_core.c
      EX_TRACE("DHCP client process succeeded.\n");
      EX_TRACE("IP address configured : %s .\n", addr_string);
      EX_TRACE("IP address mask       : %s .\n", mask_string);
      EX_TRACE("IP address gateway    : %s .\n", gateway_string);
      break;

    case DHCPc_STATUS_FAIL_ADDR_USED:
      EX_TRACE("DHCP client process failed: Address already used on network.\n");
      break;

    case DHCPc_STATUS_FAIL_OFFER_DECLINE:
      EX_TRACE("DHCP client process failed: DHCP client declined the offer.\n");
      break;

    case DHCPc_STATUS_FAIL_NAK_RX:
      EX_TRACE("DHCP client process failed: The DHCP server refused the client.\n");
      break;

    case DHCPc_STATUS_FAIL_NO_SERVER:
      EX_TRACE("DHCP client process failed: No DHCP server was detected on the network.\n");
      break;

    case DHCPc_STATUS_FAIL_ERR_FAULT:
#if ((RTOS_ERR_CFG_EXT_EN == DEF_ENABLED) \
      && (RTOS_ERR_CFG_STR_EN == DEF_ENABLED))
      EX_TRACE("DHCP client process failed: Fatal error %s.\n", err.CodeText);
#else
      EX_TRACE("DHCP client process failed: Fatal error %i.\n", err.Code);
#endif
      break;

    default:
      EX_TRACE("DHCP client invalid result.\n");
      break;
  }
}
#endif

/***************************************************************************//**
 *  @brief Hook function called when IPv4 Link local process 
 *         has been complete on an network interface.
 *
 *  @param if_nbr Network Interface number on which 
 *                IPv4 link local process occurred.
 *
 *  @param link_local_addr IPv4 link local address, if configured.
 *                         Else, NET_IPv4_ADDR_NONE.
 *
 *  @param status IPv4 Link Local process status:
 *                                       NET_IPv4_LINK_LOCAL_STATUS_NONE
 *                                       NET_IPv4_LINK_LOCAL_STATUS_SUCCEEDED
 *                                       NET_IPv4_LINK_LOCAL_STATUS_FAILED
 *
 *  @param err Error object in case an error occurred.
 *             Else, RTOS_ERR_NONE.
 *  @note IPv4 link local address configuration will only be started 
 *        if its enabled in the
 *                   NET_IF_ETHER_CFG object, but also if no other 
 *                   IPv4 valid addresses are configured on the network interface.
 *                   Therefore, it will occurred if :
 *                       (a)  no IPv4 static address is set up and DHCP process is disabled.
 *                       (b)  the DHCP setup fails and no IPv4 static address is set up.
 ******************************************************************************/
#ifdef  EX_NET_CORE_IF_EXT_EN
static  void  Ex_IPv4_LinkLocalAddrCfgResult(NET_IF_NBR                  if_nbr,
                                             NET_IPv4_ADDR               link_local_addr,
                                             NET_IPv4_LINK_LOCAL_STATUS  status,
                                             RTOS_ERR                    err)
{
  CPU_CHAR  addr_str[NET_ASCII_LEN_MAX_ADDR_IPv4];
  RTOS_ERR  local_err;

  EX_TRACE("On Interface number #%i, \n", if_nbr);

  switch (status) {
    case NET_IPv4_LINK_LOCAL_STATUS_SUCCEEDED:
      if (link_local_addr != NET_IPv4_ADDR_NONE) {
        NetASCII_IPv4_to_Str(link_local_addr, addr_str, DEF_YES, &local_err);
        if (local_err.Code != RTOS_ERR_NONE) {
          return;
        }
      }
      EX_TRACE("IPv4 link local address: %s, was configured successfully!\n", addr_str);
      break;

    case NET_IPv4_LINK_LOCAL_STATUS_FAILED:
#if ((RTOS_ERR_CFG_EXT_EN == DEF_ENABLED) \
      && (RTOS_ERR_CFG_STR_EN == DEF_ENABLED))
      EX_TRACE("IPv4 link local address configuration failed: %s.\n", err.CodeText);
#else
      EX_TRACE("IPv4 link local address configuration failed: %i.\n", err.Code);
#endif
      break;

    default:
      break;
  }
}
#endif

/***************************************************************************//**
 *  @brief Hook function called when DHCP process 
 *         has been complete on an network interface.
 *
 *  @param if_nbr Network Interface number on which DHCP process occurred.
 *
 *  @param status DHCP process status:
 *                               DHCPc_STATUS_SUCCESS
 *                               DHCPc_STATUS_FAIL_ADDR_USED
 *                               DHCPc_STATUS_FAIL_OFFER_DECLINE
 *                               DHCPc_STATUS_FAIL_NAK_RX
 *                               DHCPc_STATUS_FAIL_NO_SERVER
 *                               DHCPc_STATUS_FAIL_ERR_FAULT
 *
 *  @param addr IPv4 address configured, if any.
 *              Else, NET_IPv4_ADDR_NONE.
 *
 *  @param mask IPv4 mask configured, if any.
 *              Else, NET_IPv4_ADDR_NONE.
 *
 *  @param gateway IPv4 gateway configured, if any.
 *                 Else, NET_IPv4_ADDR_NONE.
 *
 *  @param err Error object in case an error occurred.
 *             Else, RTOS_ERR_NONE.
 *
 *  @note This hook is used for the manual network interface setup. Therefore if the DHCP
 *        setup fails, the IPv4 link local address configuration API is called to start the
 *        link local process.
 ******************************************************************************/
#if ((NET_IPv4_CFG_EN               == DEF_ENABLED) \
  && (NET_DHCP_CLIENT_CFG_MODULE_EN == DEF_ENABLED) \
  && (defined(EX_NET_CORE_IF_EXT_EN)))
static  void  Ex_DHCPc_Hook(NET_IF_NBR     if_nbr,
                            DHCPc_STATUS   status,
                            NET_IPv4_ADDR  addr,
                            NET_IPv4_ADDR  mask,
                            NET_IPv4_ADDR  gateway,
                            RTOS_ERR       err)
{
  CPU_CHAR   addr_string[NET_ASCII_LEN_MAX_ADDR_IPv4];
  CPU_CHAR   mask_string[NET_ASCII_LEN_MAX_ADDR_IPv4];
  CPU_CHAR   gateway_string[NET_ASCII_LEN_MAX_ADDR_IPv4];
  RTOS_ERR   local_err;

  PP_UNUSED_PARAM(if_nbr);

  switch (status) {
    case DHCPc_STATUS_SUCCESS:
      NetASCII_IPv4_to_Str(addr, addr_string, DEF_NO, &local_err);
      APP_RTOS_ASSERT_CRITICAL((local_err.Code == RTOS_ERR_NONE),; );

      NetASCII_IPv4_to_Str(mask, mask_string, DEF_NO, &local_err);
      APP_RTOS_ASSERT_CRITICAL((local_err.Code == RTOS_ERR_NONE),; );

      NetASCII_IPv4_to_Str(gateway, gateway_string, DEF_NO, &local_err);
      APP_RTOS_ASSERT_CRITICAL((local_err.Code == RTOS_ERR_NONE),; );

